# language: fa
قابلیت: تعریف تجهیزات
  مدیر فنی تجهیزات کارخانه را با حداقل اطلاعات ثبت می کند
  تا برنامه تعمیرات و نگهداری آن ها بدون منتظر ماندن برای تکمیل شناسنامه تجهیز قابل تعریف باشد

  پیش زمینه:
    با در نظر گرفتن اینکه رضازاده وارد سیستم شده باشد

  سناریو: ثبت تجهیز جدید فقط با نام
    وقتی رضازاده تجهیز جدیدی با نام "اکسترودر 1" ثبت می کند
    انتظار می رود تجهیز "اکسترودر 1" در سیستم ثبت شده باشد

  سناریو: ویرایش نام تجهیز
    با در نظر گرفتن اینکه تجهیزی با نام "اکسترودر 1" در سیستم ثبت شده باشد
    وقتی رضازاده نام تجهیز "اکسترودر 1" را به "اکسترودر خط یک" تغییر می دهد
    انتظار می رود تجهیز "اکسترودر خط یک" در سیستم ثبت شده باشد

  قانون: فقط مدیر فنی و مدیر سیستم مجاز به ثبت و ویرایش تجهیزات هستند

    الگوی سناریو: ثبت تجهیز توسط کاربر مجاز
      با در نظر گرفتن اینکه <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تجهیز جدیدی با نام "اکسترودر 1" ثبت می کند
      انتظار می رود تجهیز "اکسترودر 1" در سیستم ثبت شده باشد

      نمونه ها:
        | کاربر    |
        | رضازاده  |
        | یاشار    |

    الگوی سناریو: تلاش کاربر بدون دسترسی برای ثبت تجهیز جدید
      با در نظر گرفتن اینکه <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند تجهیز جدیدی ثبت کند
      انتظار می رود تجهیز جدیدی ثبت نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | مسلمی  |
        | مصطفی  |
        | نیکروش |
        | سینا   |

    الگوی سناریو: تلاش کاربر بدون دسترسی برای ویرایش تجهیز
      با در نظر گرفتن اینکه تجهیزی با نام "اکسترودر 1" در سیستم ثبت شده باشد
      و <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند نام تجهیز "اکسترودر 1" را تغییر دهد
      انتظار می رود تجهیز ویرایش نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | مسلمی  |
        | مصطفی  |
        | نیکروش |
        | سینا   |

  قانون: نام تجهیز نمی تواند خالی باشد

    مثال: ثبت تجهیز بدون نام
      وقتی رضازاده اطلاعات تجهیز جدید را وارد می کند
      اما نام تجهیز را خالی می گذارد
      انتظار می رود تجهیز جدیدی ثبت نشده باشد
      و پیغام خطای نام تجهیز نشان داده شود

    مثال: پاک کردن نام تجهیز
      با در نظر گرفتن اینکه تجهیزی با نام "اکسترودر 1" در سیستم ثبت شده باشد
      وقتی رضازاده نام آن تجهیز را پاک می کند
      انتظار می رود تجهیز ویرایش نشده باشد
      و پیغام خطای نام تجهیز نشان داده شود

  قانون: نام هر تجهیز باید یکتا باشد

    مثال: ثبت تجهیز با نام تکراری
      با در نظر گرفتن اینکه تجهیزی با نام "اکسترودر 1" در سیستم ثبت شده باشد
      وقتی رضازاده تجهیز جدیدی با نام "اکسترودر 1" ثبت می کند
      انتظار می رود تجهیز جدیدی ثبت نشده باشد
      و پیغام خطای تکراری بودن نام تجهیز نشان داده شود

    مثال: ویرایش نام تجهیز به نامی تکراری
      با در نظر گرفتن اینکه تجهیزی با نام "اکسترودر 1" و تجهیز دیگری با نام "اکسترودر 2" در سیستم ثبت شده باشد
      وقتی رضازاده نام تجهیز "اکسترودر 2" را به "اکسترودر 1" تغییر می دهد
      انتظار می رود تجهیز ویرایش نشده باشد
      و پیغام خطای تکراری بودن نام تجهیز نشان داده شود
