# language: fa
قابلیت: تعریف فعالیت های تعمیرات و نگهداری
  مدیر فنی هر فعالیت تعمیرات و نگهداری را یک بار تعریف می کند
  تا همان فعالیت در برنامه تجهیزات مختلف به کار برود

  پیش زمینه:
    با در نظر گرفتن اینکه رضازاده وارد سیستم شده باشد

  سناریو: ثبت فعالیت جدید
    وقتی رضازاده فعالیت جدیدی با نام "تعویض روغن" ثبت می کند
    انتظار می رود فعالیت "تعویض روغن" در سیستم ثبت شده باشد

  سناریو: ویرایش نام فعالیت
    با در نظر گرفتن اینکه فعالیتی با نام "بررسی تابلو برق" در سیستم ثبت شده باشد
    وقتی رضازاده نام فعالیت "بررسی تابلو برق" را به "بررسی و آچارکشی تابلو برق" تغییر می دهد
    انتظار می رود فعالیت "بررسی و آچارکشی تابلو برق" در سیستم ثبت شده باشد

  قانون: فقط مدیر فنی و مدیر سیستم مجاز به ثبت و ویرایش فعالیت ها هستند

    الگوی سناریو: تلاش کاربر بدون دسترسی برای ثبت فعالیت جدید
      با در نظر گرفتن اینکه <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند فعالیت جدیدی ثبت کند
      انتظار می رود فعالیت جدیدی ثبت نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | مسلمی  |
        | مصطفی  |
        | نیکروش |
        | سینا   |

    الگوی سناریو: تلاش کاربر بدون دسترسی برای ویرایش فعالیت
      با در نظر گرفتن اینکه فعالیتی با نام "تعویض روغن" در سیستم ثبت شده باشد
      و <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند نام فعالیت "تعویض روغن" را تغییر دهد
      انتظار می رود فعالیت ویرایش نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | مسلمی  |
        | مصطفی  |
        | نیکروش |
        | سینا   |

  قانون: نام فعالیت نمی تواند خالی باشد

    مثال: ثبت فعالیت بدون نام
      وقتی رضازاده اطلاعات فعالیت جدید را وارد می کند
      اما نام فعالیت را خالی می گذارد
      انتظار می رود فعالیت جدیدی ثبت نشده باشد
      و پیغام خطای نام فعالیت نشان داده شود

  قانون: نام هر فعالیت باید یکتا باشد

    مثال: ثبت فعالیت با نام تکراری
      با در نظر گرفتن اینکه فعالیتی با نام "تعویض روغن" در سیستم ثبت شده باشد
      وقتی رضازاده فعالیت جدیدی با نام "تعویض روغن" ثبت می کند
      انتظار می رود فعالیت جدیدی ثبت نشده باشد
      و پیغام خطای تکراری بودن نام فعالیت نشان داده شود

    مثال: ویرایش نام فعالیت به نامی تکراری
      با در نظر گرفتن اینکه فعالیتی با نام "تعویض روغن" و فعالیت دیگری با نام "بررسی تابلو برق" در سیستم ثبت شده باشد
      وقتی رضازاده نام فعالیت "بررسی تابلو برق" را به "تعویض روغن" تغییر می دهد
      انتظار می رود فعالیت ویرایش نشده باشد
      و پیغام خطای تکراری بودن نام فعالیت نشان داده شود
