# language: fa
قابلیت: ثبت آنالیز استاندارد 

  پیش زمینه: 
    با در نظر گرفتن اینکه محصول "کابل شبکه U/UTP 0.42 LEGRAND" در سیستم ثبت شده باشد 
    و مصطفی وارد سیستم شده باشد 

  سناریو: ثبت آنالیز استاندارد جدید
    وقتی مصطفی آنالیز استاندارد جدید برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" ثبت می کند
    انتظار می رود آنالیز استاندارد جدیدی اضافه شده باشد

  سناریو: ویرایش آنالیز استاندارد
    با در نظر گرفتن اینکه یک آنالیز استاندارد برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" ثبت شده باشد
    وقتی مصطفی آنالیز استاندارد را ویرایش میکند 
    انتظار می رود اطلاعات ویرایش شده در سیستم ثبت شده باشد 

  سناریو: حذف آنالیز استاندارد
    با در نظر گرفتن اینکه یک آنالیز استاندارد برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" ثبت شده باشد
    وقتی مصطفی آنالیز استاندارد را حذف میکند 
    انتظار می رود آنالیز استاندارد از سیستم حذف شده باشد

  قانون: فقط مدیریت و مدیر سیستم مجاز به ثبت، ویرایش یا حذف آنالیز استاندارد هستند

    الگوی سناریو: تلاش کاربر بدون دسترسی برای ثبت آنالیز استاندارد جدید
      با در نظر گرفتن اینکه <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند آنالیز استاندارد جدید برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" ثبت کند
      انتظار می رود آنالیز استاندارد جدیدی ثبت نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | سینا   |
        | نیکروش |

    الگوی سناریو: تلاش کاربر بدون دسترسی برای ویرایش آنالیز استاندارد
      با در نظر گرفتن اینکه یک آنالیز استاندارد برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" ثبت شده باشد
      و <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند آنالیز استاندارد را ویرایش کند
      انتظار می رود آنالیز استاندارد ویرایش نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | سینا   |
        | نیکروش |

    الگوی سناریو: تلاش کاربر بدون دسترسی برای حذف آنالیز استاندارد
      با در نظر گرفتن اینکه یک آنالیز استاندارد برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" ثبت شده باشد
      و <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند آنالیز استاندارد را حذف کند
      انتظار می رود آنالیز استاندارد از سیستم حذف نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | سینا   |
        | نیکروش |

  قانون: وضعیت فعال بودن آنالیز استاندارد باید هنگام ثبت توسط کاربر مشخص شود

    مثال: عدم تعیین وضعیت فعال بودن هنگام ثبت
      وقتی مصطفی اطلاعات آنالیز استاندارد جدید برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" وارد میکند
      اما وضعیت فعال بودن را مشخص نمی کند
      انتظار می رود آنالیز استاندارد جدیدی ثبت نشده باشد
      و پیغام خطای عدم تعیین وضعیت فعال بودن نشان داده شود

  قانون: کد MI یکتا است

    مثال: ثبت با کد MI تکراری
      با در نظر گرفتن اینکه یک آنالیز استاندارد با کد MI "1234" در سیستم ثبت شده باشد
      وقتی مصطفی اطلاعات آنالیز استاندارد جدید برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" وارد میکند
      اما کد MI را "1234" وارد میکند
      انتظار می رود آنالیز استاندارد جدیدی ثبت نشده باشد
      و پیغام خطای کد MI تکراری نشان داده شود

    مثال: ویرایش با کد MI تکراری
      با در نظر گرفتن اینکه یک آنالیز استاندارد برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" در سیستم ثبت شده باشد
      وقتی مصطفی کد MI آن را به کدی تکراری تغییر می دهد
      انتظار می رود آنالیز استاندارد ویرایش نشده باشد
      و پیغام خطای کد MI تکراری نشان داده شود

  قانون: کد MI نمیتواند خالی باشد

    مثال: عدم ثبت کد MI
      وقتی مصطفی اطلاعات آنالیز استاندارد جدید برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" وارد میکند
      اما کد MI را خالی میگذارد
      انتظار می رود آنالیز استاندارد جدیدی ثبت نشده باشد
      و پیغام خطای کد MI نشان داده شود

    مثال: پاک کردن کد MI
      با در نظر گرفتن اینکه یک آنالیز استاندارد برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" در سیستم ثبت شده باشد
      وقتی مصطفی کد MI آن را پاک می کند
      انتظار می رود آنالیز استاندارد ویرایش نشده باشد
      و پیغام خطای کد MI نشان داده شود

  قانون: برند نمیتواند خالی باشد

    مثال: عدم ثبت برند
      وقتی مصطفی اطلاعات آنالیز استاندارد جدید برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" وارد میکند
      اما برند را خالی میگذارد
      انتظار می رود آنالیز استاندارد جدیدی ثبت نشده باشد
      و پیغام خطای برند نشان داده شود

    مثال: پاک کردن برند
      با در نظر گرفتن اینکه یک آنالیز استاندارد برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" در سیستم ثبت شده باشد
      وقتی مصطفی برند آن را پاک می کند
      انتظار می رود آنالیز استاندارد ویرایش نشده باشد
      و پیغام خطای برند نشان داده شود

  قانون: متراژ استاندارد نمیتواند خالی باشد

    مثال: عدم ثبت متراژ استاندارد
      وقتی مصطفی اطلاعات آنالیز استاندارد جدید برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" وارد میکند
      اما متراژ استاندارد را خالی میگذارد
      انتظار می رود آنالیز استاندارد جدیدی ثبت نشده باشد
      و پیغام خطای متراژ استاندارد نشان داده شود

    مثال: پاک کردن متراژ استاندارد
      با در نظر گرفتن اینکه یک آنالیز استاندارد برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" در سیستم ثبت شده باشد
      وقتی مصطفی متراژ استاندارد آن را پاک می کند
      انتظار می رود آنالیز استاندارد ویرایش نشده باشد
      و پیغام خطای متراژ استاندارد نشان داده شود

  قانون: یک آنالیز استاندارد می تواند بیش از یک جز داشته باشد

    مثال: ثبت چند جز برای یک آنالیز استاندارد
      با در نظر گرفتن اینکه یک آنالیز استاندارد برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" ثبت شده باشد
      وقتی مصطفی چند جز برای آن آنالیز استاندارد ثبت می کند
      انتظار می رود تمام اجزای ثبت شده به آنالیز استاندارد مربوط باشند

  قانون: یک جز می تواند بیش از یک مواد اولیه داشته باشد

    مثال: ثبت چند مواد اولیه برای یک جز
      با در نظر گرفتن اینکه یک جز برای یک آنالیز استاندارد در سیستم ثبت شده باشد
      وقتی مصطفی چند مواد اولیه برای آن جز ثبت می کند
      انتظار می رود تمام مواد اولیه ثبت شده به جز مربوط باشند