# language: fa
قابلیت: ثبت محصول

پیش زمینه:
با در نظر گرفتن اینکه مصطفی وارد سیستم شده باشد

سناریو: ثبت محصول جدید
وقتی مصطفی محصول جدیدی با اطلاعات معتبر ثبت می کند
انتظار می رود محصول جدیدی در سیستم ثبت شده باشد

سناریو: ویرایش محصول
با در نظر گرفتن اینکه یک محصول در سیستم ثبت شده باشد
وقتی مصطفی اطلاعات آن محصول را ویرایش می کند
انتظار می رود اطلاعات ویرایش شده محصول در سیستم ثبت شده باشد

سناریو: حذف محصول
با در نظر گرفتن اینکه یک محصول در سیستم ثبت شده باشد
وقتی مصطفی آن محصول را حذف می کند
انتظار می رود آن محصول از سیستم حذف شده باشد

سناریو: نمایش فهرست اجزا و مواد اولیه ثبت‌شده هنگام ثبت محصول
با در نظر گرفتن اینکه یک جز و یک مواد اولیه در سیستم ثبت شده باشند
وقتی مصطفی فرم ثبت محصول جدید را باز می کند
انتظار می رود آن جز و آن مواد اولیه در فهرست انتخاب نشان داده شوند

قانون: فقط مدیریت و مدیر سیستم مجاز به ثبت، ویرایش یا حذف محصول هستند

الگوی سناریو: تلاش کاربر بدون دسترسی برای ثبت محصول جدید
  با در نظر گرفتن اینکه <کاربر> وارد سیستم شده باشد
  وقتی <کاربر> تلاش می کند محصول جدیدی ثبت کند
  انتظار می رود محصول جدیدی ثبت نشده باشد
  و پیغام خطای عدم دسترسی نشان داده شود

  نمونه ها:
    | کاربر  |
    | سینا   |
    | نیکروش |

الگوی سناریو: تلاش کاربر بدون دسترسی برای ویرایش محصول
  با در نظر گرفتن اینکه یک محصول در سیستم ثبت شده باشد
  و <کاربر> وارد سیستم شده باشد
  وقتی <کاربر> تلاش می کند اطلاعات آن محصول را ویرایش کند
  انتظار می رود محصول ویرایش نشده باشد
  و پیغام خطای عدم دسترسی نشان داده شود

  نمونه ها:
    | کاربر  |
    | سینا   |
    | نیکروش |

الگوی سناریو: تلاش کاربر بدون دسترسی برای حذف محصول
  با در نظر گرفتن اینکه یک محصول در سیستم ثبت شده باشد
  و <کاربر> وارد سیستم شده باشد
  وقتی <کاربر> تلاش می کند آن محصول را حذف کند
  انتظار می رود آن محصول از سیستم حذف نشده باشد
  و پیغام خطای عدم دسترسی نشان داده شود

  نمونه ها:
    | کاربر  |
    | سینا   |
    | نیکروش |

قانون: هر محصول حداقل یک جز دارد

مثال: ثبت محصول بدون جز
  وقتی مصطفی اطلاعات محصول جدید را وارد می کند
  اما هیچ جزئی برای محصول ثبت نمی کند
  انتظار می رود محصول جدیدی ثبت نشده باشد
  و پیغام خطای حداقل یک جز برای محصول نشان داده شود

مثال: حذف تمام اجزای محصول
  با در نظر گرفتن اینکه یک محصول با حداقل یک جز در سیستم ثبت شده باشد
  وقتی مصطفی تمام اجزای آن محصول را حذف می کند
  انتظار می رود محصول ویرایش نشده باشد
  و پیغام خطای حداقل یک جز برای محصول نشان داده شود

قانون: هر جز حداقل یک مواد اولیه دارد

مثال: ثبت جز بدون مواد اولیه
  با در نظر گرفتن اینکه یک محصول در سیستم ثبت شده باشد
  وقتی مصطفی جز جدیدی برای آن محصول ثبت می کند
  اما هیچ مواد اولیه ای برای جز ثبت نمی کند
  انتظار می رود جز جدیدی ثبت نشده باشد
  و پیغام خطای حداقل یک مواد اولیه برای جز نشان داده شود

مثال: حذف تمام مواد اولیه جز
  با در نظر گرفتن اینکه یک جز با حداقل یک مواد اولیه در سیستم ثبت شده باشد
  وقتی مصطفی تمام مواد اولیه آن جز را حذف می کند
  انتظار می رود جز ویرایش نشده باشد
  و پیغام خطای حداقل یک مواد اولیه برای جز نشان داده شود

قانون: یک محصول می تواند بیش از یک جز داشته باشد

مثال: ثبت چند جز برای یک محصول
  با در نظر گرفتن اینکه یک محصول در سیستم ثبت شده باشد
  وقتی مصطفی چند جز برای آن محصول ثبت می کند
  انتظار می رود تمام اجزای ثبت شده به محصول مربوط باشند

قانون: یک جز می تواند بیش از یک مواد اولیه داشته باشد

مثال: ثبت چند مواد اولیه برای یک جز
  با در نظر گرفتن اینکه یک جز برای یک محصول در سیستم ثبت شده باشد
  وقتی مصطفی چند مواد اولیه برای آن جز ثبت می کند
  انتظار می رود تمام مواد اولیه ثبت شده به جز مربوط باشند

قانون: اجزا و مواد اولیه استفاده‌شده در محصول باید از قبل در سیستم ثبت شده باشند

مثال: ثبت محصول با جزی که ثبت نشده است
  با در نظر گرفتن اینکه مواد اولیه‌ای در سیستم ثبت شده باشد
  وقتی مصطفی محصول جدیدی را با جزی که ثبت نشده است ثبت می کند
  انتظار می رود محصول جدیدی ثبت نشده باشد
  و پیغام خطای ثبت‌نشده بودن جز نشان داده شود

مثال: ثبت محصول با مواد اولیه‌ای که ثبت نشده است
  با در نظر گرفتن اینکه یک جز در سیستم ثبت شده باشد
  وقتی مصطفی محصول جدیدی را با مواد اولیه‌ای که ثبت نشده است برای آن جز ثبت می کند
  انتظار می رود محصول جدیدی ثبت نشده باشد
  و پیغام خطای ثبت‌نشده بودن مواد اولیه نشان داده شود
