# language: fa
  قابلیت: ثبت آنالیز روزانه

  پیش زمینه: 
  با در نظر گرفتن اینکه آنالیز استانداردی با کد MI "0001" در سیستم ثبت شده باشد 
  و نیکروش وارد سیستم شده باشد
   
  سناریو: ثبت آنالیز روزانه جدید
    وقتی نیکروش آنالیز روزانه جدید برای کد MI "0001" ثبت می کند
    انتظار می رود آنالیز روزانه جدیدی ثبت شده باشد
    
  سناریو: ویرایش آنالیز روزانه
    با در نظر گرفتن اینکه یک آنالیز روزانه برای کد MI "0001" در سیستم ثبت شده باشد
    وقتی نیکروش آن را ویرایش می کند
    انتظار می رود اطلاعات ویرایش شده در سیستم ثبت شده باشد

  سناریو: حذف آنالیز روزانه
    با در نظر گرفتن اینکه یک آنالیز روزانه برای کد MI "0001" در سیستم ثبت شده باشد
    وقتی نیکروش آن را حذف می کند
    انتظار می رود آن آنالیز روزانه از سیستم حذف شده باشد
  

  قانون: فقط اپراتور کنترل کیفیت، مدیر کنترل کیفیت و مدیر سیستم مجاز به ثبت، ویرایش یا حذف آنالیز روزانه هستند

    مثال: تلاش مدیر فروش برای ثبت آنالیز روزانه
      با در نظر گرفتن اینکه سینا وارد سیستم شده باشد
      وقتی سینا تلاش می کند آنالیز روزانه جدید برای کد MI "0001" ثبت کند
      انتظار می رود آنالیز روزانه جدیدی ثبت نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

    مثال: تلاش مدیر فروش برای ویرایش آنالیز روزانه
      با در نظر گرفتن اینکه یک آنالیز روزانه برای کد MI "0001" در سیستم ثبت شده باشد
      و سینا وارد سیستم شده باشد
      وقتی سینا تلاش می کند آن را ویرایش کند
      انتظار می رود آنالیز روزانه ویرایش نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

    مثال: تلاش مدیر فروش برای حذف آنالیز روزانه
      با در نظر گرفتن اینکه یک آنالیز روزانه برای کد MI "0001" در سیستم ثبت شده باشد
      و سینا وارد سیستم شده باشد
      وقتی سینا تلاش می کند آن را حذف کند
      انتظار می رود آن آنالیز روزانه از سیستم حذف نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

  قانون: یک آنالیز روزانه باید شماره سفارش داشته باشد
    
    مثال: عدم ثبت شماره سفارش 
      وقتی نیکروش اطلاعات آنالیز جدید برای کد MI "0001" وارد میکند
      اما شماره سفارش را خالی میگذارد
      انتظار می رود آنالیز جدیدی ثبت نشده باشد 
      و پیغام خطای شماره سفارش نشان داده شود

    مثال: پاک کردن شماره سفارش 
       با در نظر گرفتن اینکه یک آنالیز روزانه برای کد MI "0001" در سیستم ثبت شده باشد
       وقتی نیکروش شماره شفارش آن را پاک می کند
       انتظار می رود آنالیز روزانه ویرایش نشده باشد 
       و پیغام خطای شماره سفارش نشان داده شود
       
      
      
  قانون: یک آنالیز روزانه باید  شماره ردیابی داشته باشد
  
    مثال: عدم ثبت شماره ردیابی 
      وقتی نیکروش اطلاعات آنالیز روزانه جدید برای کد MI "0001" وارد میکند
      اما شماره ردیابی را خالی میگذارد
      انتظار می رود آنالیز جدیدی ثبت نشده باشد 
      و پیغام خطای شماره ردیابی نشان داده شود 

    مثال: پاک کردن شماره ردیابی 
      با در نظر گرفتن اینکه یک آنالیز روزانه برای کد MI "0001" در سیستم ثبت شده باشد
      وقتی نیکروش شماره ردیابی آن را پاک می کند
      انتظار می رود آنالیز روزانه ویرایش نشده باشد 
      و پیغام خطای شماره ردیابی نشان داده شود

  قانون: وزن مواد اولیه نمیتواند ثبت نشود
  
    مثال: عدم ثبت وزن برای مواد اولیه
      وقتی نیکروش اطلاعات آنالیز روزانه جدید برای کد MI "0001" وارد میکند
      اما وزن هر یک از مواد اولیه ها را خالی میگذارد
      انتظار می رود آنالیز جدیدی ثبت نشده باشد 
      و پیغام خطای وزن مواد اولیه نامعتبر نشان داده شود
      
    مثال:پاک کردن وزن برای مواد اولیه
      با در نظر گرفتن اینکه یک آنالیز روزانه برای کد MI "0001" در سیستم ثبت شده باشد
      وقتی نیکروش وزن یکی از مواد اولیه آن را پاک می کند
      انتظار می رود آنالیز روزانه ویرایش نشده باشد
      و پیغام خطای وزن مواد اولیه نامعتبر داده شود


  قانون: وزن مواد اولیه نمیتواند صفر باشد

    مثال: ثبت وزن صفر برای مواد اولیه
      وقتی نیکروش اطلاعات آنالیز روزانه جدید برای کد MI "0001" وارد میکند
      اما وزن هر یک از مواد اولیه ها را صفر میگذارد
      انتظار می رود آنالیز جدیدی ثبت نشده باشد 
      و پیغام خطای وزن مواد اولیه نامعتبر نشان داده شود

    مثال:صفر وزن برای مواد اولیه
      با در نظر گرفتن اینکه یک آنالیز روزانه برای کد MI "0001" در سیستم ثبت شده باشد
      وقتی نیکروش وزن یکی از مواد اولیه آن را صفر می کند
      انتظار می رود آنالیز روزانه ویرایش نشده باشد 
      و پیغام خطای وزن مواد اولیه نامعتبر داده شود
      
  قانون: یک آنالیز میتواند توضیحات نداشته باشد
  
    مثال:ثبت آنالیز بدون توضیحات 
      وقتی نیکروش آنالیز روزانه جدید برای کد MI "0001" ثبت می کند
      اما توضیحات را خالی میگذراد
      انتظار می رود آنالیز جدیدی ثبت شده باشد

    مثال:پاک کردن توضیحات آنالیز
      با در نظر گرفتن اینکه یک آنالیز روزانه برای کد MI "0001" در سیستم ثبت شده باشد
      وقتی نیکروش توضیحیات آن را پاک می کند
      انتظار می رود آنالیز روزانه ویرایش شده باشد
      
      

      
      

  
  
  

  
  
  
  