# language: fa

قابلیت: ثبت مواد اولیه

پیش زمینه:
با در نظر گرفتن اینکه مصطفی وارد سیستم شده باشد

سناریو: ثبت مواد اولیه جدید
وقتی مصطفی مواد اولیه جدیدی با اطلاعات معتبر ثبت می کند
انتظار می رود مواد اولیه جدیدی در سیستم ثبت شده باشد

سناریو: ویرایش مواد اولیه
با در نظر گرفتن اینکه یک مواد اولیه در سیستم ثبت شده باشد
وقتی مصطفی اطلاعات آن مواد اولیه را ویرایش می کند
انتظار می رود اطلاعات ویرایش شده مواد اولیه در سیستم ثبت شده باشد

سناریو: حذف مواد اولیه
با در نظر گرفتن اینکه یک مواد اولیه در سیستم ثبت شده باشد
وقتی مصطفی آن مواد اولیه را حذف می کند
انتظار می رود آن مواد اولیه از سیستم حذف شده باشد

قانون: فقط مدیریت و مدیر سیستم مجاز به ثبت، ویرایش یا حذف مواد اولیه هستند

الگوی سناریو: تلاش کاربر بدون دسترسی برای ثبت مواد اولیه جدید
  با در نظر گرفتن اینکه <کاربر> وارد سیستم شده باشد
  وقتی <کاربر> تلاش می کند مواد اولیه جدیدی ثبت کند
  انتظار می رود مواد اولیه جدیدی ثبت نشده باشد
  و پیغام خطای عدم دسترسی نشان داده شود

  نمونه ها:
    | کاربر  |
    | سینا   |
    | نیکروش |

الگوی سناریو: تلاش کاربر بدون دسترسی برای ویرایش مواد اولیه
  با در نظر گرفتن اینکه یک مواد اولیه در سیستم ثبت شده باشد
  و <کاربر> وارد سیستم شده باشد
  وقتی <کاربر> تلاش می کند اطلاعات آن مواد اولیه را ویرایش کند
  انتظار می رود مواد اولیه ویرایش نشده باشد
  و پیغام خطای عدم دسترسی نشان داده شود

  نمونه ها:
    | کاربر  |
    | سینا   |
    | نیکروش |

الگوی سناریو: تلاش کاربر بدون دسترسی برای حذف مواد اولیه
  با در نظر گرفتن اینکه یک مواد اولیه در سیستم ثبت شده باشد
  و <کاربر> وارد سیستم شده باشد
  وقتی <کاربر> تلاش می کند آن مواد اولیه را حذف کند
  انتظار می رود آن مواد اولیه از سیستم حذف نشده باشد
  و پیغام خطای عدم دسترسی نشان داده شود

  نمونه ها:
    | کاربر  |
    | سینا   |
    | نیکروش |

قانون: اسم مواد اولیه نباید خالی باشد

مثال: ثبت مواد اولیه بدون اسم
  وقتی مصطفی اطلاعات مواد اولیه جدید را وارد می کند
  اما اسم مواد اولیه را خالی می گذارد
  انتظار می رود مواد اولیه جدیدی ثبت نشده باشد
  و پیغام خطای اسم مواد اولیه نشان داده شود

مثال: پاک کردن اسم مواد اولیه
  با در نظر گرفتن اینکه یک مواد اولیه در سیستم ثبت شده باشد
  وقتی مصطفی اسم آن مواد اولیه را پاک می کند
  انتظار می رود مواد اولیه ویرایش نشده باشد
  و پیغام خطای اسم مواد اولیه نشان داده شود

قانون: اسم هر مواد اولیه باید یونیک باشد

مثال: ثبت مواد اولیه با اسم تکراری
  با در نظر گرفتن اینکه مواد اولیه ای با اسم "مسی" در سیستم ثبت شده باشد
  وقتی مصطفی مواد اولیه جدیدی با اسم "مسی" ثبت می کند
  انتظار می رود مواد اولیه جدیدی ثبت نشده باشد
  و پیغام خطای تکراری بودن اسم مواد اولیه نشان داده شود

مثال: ویرایش مواد اولیه با اسم تکراری
  با در نظر گرفتن اینکه مواد اولیه ای با اسم "مسی" و مواد اولیه دیگری با اسم "آلومینیوم" در سیستم ثبت شده باشد
  وقتی مصطفی اسم مواد اولیه "آلومینیوم" را به "مسی" تغییر می دهد
  انتظار می رود مواد اولیه ویرایش نشده باشد
  و پیغام خطای تکراری بودن اسم مواد اولیه نشان داده شود
