# language: fa

قابلیت: ثبت جز

پیش زمینه:
با در نظر گرفتن اینکه مصطفی وارد سیستم شده باشد

سناریو: ثبت جز جدید
وقتی مصطفی جز جدیدی با اطلاعات معتبر ثبت می کند
انتظار می رود جز جدیدی در سیستم ثبت شده باشد

سناریو: ویرایش جز
با در نظر گرفتن اینکه یک جز در سیستم ثبت شده باشد
وقتی مصطفی اطلاعات آن جز را ویرایش می کند
انتظار می رود اطلاعات ویرایش شده جز در سیستم ثبت شده باشد

سناریو: حذف جز
با در نظر گرفتن اینکه یک جز در سیستم ثبت شده باشد
وقتی مصطفی آن جز را حذف می کند
انتظار می رود آن جز از سیستم حذف شده باشد

قانون: فقط مدیر کنترل کیفیت و مدیر سیستم مجاز به ثبت، ویرایش یا حذف جز هستند

الگوی سناریو: تلاش کاربر بدون دسترسی برای ثبت جز جدید
  با در نظر گرفتن اینکه <کاربر> وارد سیستم شده باشد
  وقتی <کاربر> تلاش می کند جز جدیدی ثبت کند
  انتظار می رود جز جدیدی ثبت نشده باشد
  و پیغام خطای عدم دسترسی نشان داده شود

  نمونه ها:
    | کاربر  |
    | سینا   |
    | نیکروش |

الگوی سناریو: تلاش کاربر بدون دسترسی برای ویرایش جز
  با در نظر گرفتن اینکه یک جز در سیستم ثبت شده باشد
  و <کاربر> وارد سیستم شده باشد
  وقتی <کاربر> تلاش می کند اطلاعات آن جز را ویرایش کند
  انتظار می رود جز ویرایش نشده باشد
  و پیغام خطای عدم دسترسی نشان داده شود

  نمونه ها:
    | کاربر  |
    | سینا   |
    | نیکروش |

الگوی سناریو: تلاش کاربر بدون دسترسی برای حذف جز
  با در نظر گرفتن اینکه یک جز در سیستم ثبت شده باشد
  و <کاربر> وارد سیستم شده باشد
  وقتی <کاربر> تلاش می کند آن جز را حذف کند
  انتظار می رود آن جز از سیستم حذف نشده باشد
  و پیغام خطای عدم دسترسی نشان داده شود

  نمونه ها:
    | کاربر  |
    | سینا   |
    | نیکروش |

قانون: اسم جز نباید خالی باشد

مثال: ثبت جز بدون اسم
  وقتی مصطفی اطلاعات جز جدید را وارد می کند
  اما اسم جز را خالی می گذارد
  انتظار می رود جز جدیدی ثبت نشده باشد
  و پیغام خطای اسم جز نشان داده شود

مثال: پاک کردن اسم جز
  با در نظر گرفتن اینکه یک جز در سیستم ثبت شده باشد
  وقتی مصطفی اسم آن جز را پاک می کند
  انتظار می رود جز ویرایش نشده باشد
  و پیغام خطای اسم جز نشان داده شود

قانون: اسم هر جز باید یونیک باشد

مثال: ثبت جز با اسم تکراری
  با در نظر گرفتن اینکه جزئی با اسم "مغزی" در سیستم ثبت شده باشد
  وقتی مصطفی جز جدیدی با اسم "مغزی" ثبت می کند
  انتظار می رود جز جدیدی ثبت نشده باشد
  و پیغام خطای تکراری بودن اسم جز نشان داده شود

مثال: ویرایش جز با اسم تکراری
  با در نظر گرفتن اینکه جزئی با اسم "مغزی" و جز دیگری با اسم "روکش" در سیستم ثبت شده باشد
  وقتی مصطفی اسم جز "روکش" را به "مغزی" تغییر می دهد
  انتظار می رود جز ویرایش نشده باشد
  و پیغام خطای تکراری بودن اسم جز نشان داده شود
