# language: fa

قابلیت: ثبت مواد اولیه

پیش زمینه:
با در نظر گرفتن اینکه مصطفی وارد سیستم شده باشد

سناریو: ثبت مواد اولیه جدید
وقتی مصطفی مواد اولیه جدیدی با اطلاعات معتبر ثبت می کند
انتظار می رود مواد اولیه جدیدی در سیستم ثبت شده باشد

سناریو: ویرایش مواد اولیه
با در نظر گرفتن اینکه یک مواد اولیه در سیستم ثبت شده باشد
وقتی مصطفی اطلاعات آن مواد اولیه را ویرایش می کند
انتظار می رود اطلاعات ویرایش شده مواد اولیه در سیستم ثبت شده باشد

سناریو: حذف مواد اولیه
با در نظر گرفتن اینکه یک مواد اولیه در سیستم ثبت شده باشد
وقتی مصطفی آن مواد اولیه را حذف می کند
انتظار می رود آن مواد اولیه از سیستم حذف شده باشد

قانون: فقط مدیریت و مدیر سیستم مجاز به ثبت، ویرایش یا حذف مواد اولیه هستند

الگوی سناریو: تلاش کاربر بدون دسترسی برای ثبت مواد اولیه جدید
  با در نظر گرفتن اینکه <کاربر> وارد سیستم شده باشد
  وقتی <کاربر> تلاش می کند مواد اولیه جدیدی ثبت کند
  انتظار می رود مواد اولیه جدیدی ثبت نشده باشد
  و پیغام خطای عدم دسترسی نشان داده شود

  نمونه ها:
    | کاربر  |
    | سینا   |
    | نیکروش |

الگوی سناریو: تلاش کاربر بدون دسترسی برای ویرایش مواد اولیه
  با در نظر گرفتن اینکه یک مواد اولیه در سیستم ثبت شده باشد
  و <کاربر> وارد سیستم شده باشد
  وقتی <کاربر> تلاش می کند اطلاعات آن مواد اولیه را ویرایش کند
  انتظار می رود مواد اولیه ویرایش نشده باشد
  و پیغام خطای عدم دسترسی نشان داده شود

  نمونه ها:
    | کاربر  |
    | سینا   |
    | نیکروش |

الگوی سناریو: تلاش کاربر بدون دسترسی برای حذف مواد اولیه
  با در نظر گرفتن اینکه یک مواد اولیه در سیستم ثبت شده باشد
  و <کاربر> وارد سیستم شده باشد
  وقتی <کاربر> تلاش می کند آن مواد اولیه را حذف کند
  انتظار می رود آن مواد اولیه از سیستم حذف نشده باشد
  و پیغام خطای عدم دسترسی نشان داده شود

  نمونه ها:
    | کاربر  |
    | سینا   |
    | نیکروش |

قانون: اسم مواد اولیه نباید خالی باشد

مثال: ثبت مواد اولیه بدون اسم
  وقتی مصطفی اطلاعات مواد اولیه جدید را وارد می کند
  اما اسم مواد اولیه را خالی می گذارد
  انتظار می رود مواد اولیه جدیدی ثبت نشده باشد
  و پیغام خطای اسم مواد اولیه نشان داده شود

مثال: پاک کردن اسم مواد اولیه
  با در نظر گرفتن اینکه یک مواد اولیه در سیستم ثبت شده باشد
  وقتی مصطفی اسم آن مواد اولیه را پاک می کند
  انتظار می رود مواد اولیه ویرایش نشده باشد
  و پیغام خطای اسم مواد اولیه نشان داده شود

قانون: اسم هر مواد اولیه باید یونیک باشد

مثال: ثبت مواد اولیه با اسم تکراری
  با در نظر گرفتن اینکه مواد اولیه ای با اسم "مسی" در سیستم ثبت شده باشد
  وقتی مصطفی مواد اولیه جدیدی با اسم "مسی" ثبت می کند
  انتظار می رود مواد اولیه جدیدی ثبت نشده باشد
  و پیغام خطای تکراری بودن اسم مواد اولیه نشان داده شود

مثال: ویرایش مواد اولیه با اسم تکراری
  با در نظر گرفتن اینکه مواد اولیه ای با اسم "مسی" و مواد اولیه دیگری با اسم "آلومینیوم" در سیستم ثبت شده باشد
  وقتی مصطفی اسم مواد اولیه "آلومینیوم" را به "مسی" تغییر می دهد
  انتظار می رود مواد اولیه ویرایش نشده باشد
  و پیغام خطای تکراری بودن اسم مواد اولیه نشان داده شود

قانون: کد مواد اولیه نباید خالی باشد

مثال: ثبت مواد اولیه بدون کد
  وقتی مصطفی اطلاعات مواد اولیه جدید را وارد می کند
  اما کد مواد اولیه را خالی می گذارد
  انتظار می رود مواد اولیه جدیدی ثبت نشده باشد
  و پیغام خطای کد مواد اولیه نشان داده شود

مثال: پاک کردن کد مواد اولیه
  با در نظر گرفتن اینکه یک مواد اولیه در سیستم ثبت شده باشد
  وقتی مصطفی کد آن مواد اولیه را پاک می کند
  انتظار می رود مواد اولیه ویرایش نشده باشد
  و پیغام خطای کد مواد اولیه نشان داده شود

قانون: رقم های کد و اسم مواد اولیه با رقم انگلیسی ثبت می شوند، حتی اگر با رقم فارسی وارد شوند

الگوی سناریو: ثبت مواد اولیه با رقم فارسی
  با در نظر گرفتن اینکه مصطفی وارد سیستم شده باشد
  وقتی مصطفی مواد اولیه جدیدی با <فیلد> "<مقدار وارد شده>" ثبت می کند
  انتظار می رود مواد اولیه جدیدی با <فیلد> "<مقدار ثبت شده>" در سیستم ثبت شده باشد

  نمونه ها:
    | فیلد | مقدار وارد شده | مقدار ثبت شده |
    | کد   | M-۱۰۱          | M-101         |
    | اسم  | مس شماره ۲     | مس شماره 2    |

قانون: کد هر مواد اولیه باید یونیک باشد

مثال: ثبت مواد اولیه با کد تکراری
  با در نظر گرفتن اینکه مواد اولیه ای با کد "M-101" در سیستم ثبت شده باشد
  وقتی مصطفی مواد اولیه جدیدی با کد "M-101" ثبت می کند
  انتظار می رود مواد اولیه جدیدی ثبت نشده باشد
  و پیغام خطای تکراری بودن کد مواد اولیه نشان داده شود

مثال: ویرایش مواد اولیه با کد تکراری
  با در نظر گرفتن اینکه مواد اولیه ای با کد "M-101" و مواد اولیه دیگری با کد "M-102" در سیستم ثبت شده باشد
  وقتی مصطفی کد مواد اولیه "M-102" را به "M-101" تغییر می دهد
  انتظار می رود مواد اولیه ویرایش نشده باشد
  و پیغام خطای تکراری بودن کد مواد اولیه نشان داده شود

مثال: ثبت مواد اولیه با کد تکراری با رقم فارسی
  با در نظر گرفتن اینکه مواد اولیه ای با کد "M-101" در سیستم ثبت شده باشد
  و مصطفی وارد سیستم شده باشد
  وقتی مصطفی مواد اولیه جدیدی با کد "M-۱۰۱" ثبت می کند
  انتظار می رود مواد اولیه جدیدی ثبت نشده باشد
  و پیغام خطای تکراری بودن کد مواد اولیه نشان داده شود
