# language: fa
قابلیت: تعیین وضعیت فعال بودن آنالیز استاندارد

  پیش زمینه:
    با در نظر گرفتن اینکه محصول "کابل شبکه U/UTP 0.42 LEGRAND" در سیستم ثبت شده باشد
    و مصطفی وارد سیستم شده باشد

  قانون: آنالیز استاندارد جدید به صورت پیش‌فرض غیرفعال ثبت می‌شود

    مثال: پیش‌فرض غیرفعال بودن آنالیز استاندارد جدید
      وقتی مصطفی آنالیز استاندارد جدید برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" ثبت می کند
      انتظار می رود آنالیز استاندارد جدید به صورت غیرفعال ثبت شده باشد

  قانون: مدیر کنترل کیفیت می تواند وضعیت فعال بودن آنالیز استاندارد را تغییر دهد

    مثال: فعال کردن آنالیز استاندارد
      با در نظر گرفتن اینکه یک آنالیز استاندارد غیرفعال برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" ثبت شده باشد
      وقتی مصطفی آن آنالیز استاندارد را فعال می کند
      انتظار می رود آنالیز استاندارد فعال شده باشد

    مثال: غیرفعال کردن آنالیز استاندارد
      با در نظر گرفتن اینکه یک آنالیز استاندارد فعال برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" ثبت شده باشد
      وقتی مصطفی آن آنالیز استاندارد را غیرفعال می کند
      انتظار می رود آنالیز استاندارد غیرفعال شده باشد

    الگوی سناریو: تلاش کاربر بدون دسترسی برای تغییر وضعیت فعال بودن آنالیز استاندارد
      با در نظر گرفتن اینکه یک آنالیز استاندارد برای محصول "کابل شبکه U/UTP 0.42 LEGRAND" ثبت شده باشد
      و <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند وضعیت فعال بودن آن آنالیز استاندارد را تغییر دهد
      انتظار می رود وضعیت آنالیز استاندارد تغییر نکرده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | سینا   |
        | نیکروش |
