# language: fa
قابلیت: ورود به سیستم

  پیش زمینه:
    با در نظر گرفتن اینکه کارمندی با نام کاربری "sina.q" و رمز عبور "Passw0rd!" در سیستم ثبت شده باشد

  سناریو: ورود موفق کارمند
    وقتی آن کارمند با نام کاربری "sina.q" و رمز عبور "Passw0rd!" وارد سیستم می شود
    انتظار می رود به او دسترسی به سیستم داده شود

  قانون: ورود با رمز عبور نادرست مجاز نیست

    مثال: تلاش برای ورود با رمز عبور اشتباه
      وقتی آن کارمند با نام کاربری "sina.q" و رمز عبور "wrong-pass" وارد سیستم می شود
      انتظار می رود دسترسی به او داده نشود
      و پیغام خطای نام کاربری یا رمز عبور نادرست نشان داده شود

  قانون: ورود با نام کاربری نامعتبر مجاز نیست

    مثال: تلاش برای ورود با نام کاربری ثبت نشده
      وقتی کاربری با نام کاربری "unknown.user" و رمز عبور "Passw0rd!" وارد سیستم می شود
      انتظار می رود دسترسی به او داده نشود
      و پیغام خطای نام کاربری یا رمز عبور نادرست نشان داده شود

  قانون: کارمند حذف شده نمی تواند وارد سیستم شود

    مثال: تلاش برای ورود پس از حذف کارمند
      با در نظر گرفتن اینکه یاشار آن کارمند را از سیستم حذف کرده باشد
      وقتی آن کارمند با نام کاربری "sina.q" و رمز عبور "Passw0rd!" وارد سیستم می شود
      انتظار می رود دسترسی به او داده نشود
      و پیغام خطای نام کاربری یا رمز عبور نادرست نشان داده شود
