# language: fa
قابلیت: ورود به سیستم

  پیش زمینه:
    با در نظر گرفتن اینکه کاربری با نام کاربری "sina.q" و رمز عبور "Passw0rd!" در سیستم ثبت شده باشد

  سناریو: ورود موفق کاربر
    وقتی آن کاربر با نام کاربری "sina.q" و رمز عبور "Passw0rd!" وارد سیستم می شود
    انتظار می رود به او دسترسی به سیستم داده شود

  قانون: ورود با رمز عبور نادرست مجاز نیست

    مثال: تلاش برای ورود با رمز عبور اشتباه
      وقتی آن کاربر با نام کاربری "sina.q" و رمز عبور "wrong-pass" وارد سیستم می شود
      انتظار می رود دسترسی به او داده نشود
      و پیغام خطای نام کاربری یا رمز عبور نادرست نشان داده شود

  قانون: ورود با نام کاربری نامعتبر مجاز نیست

    مثال: تلاش برای ورود با نام کاربری ثبت نشده
      وقتی کاربری با نام کاربری "unknown.user" و رمز عبور "Passw0rd!" وارد سیستم می شود
      انتظار می رود دسترسی به او داده نشود
      و پیغام خطای نام کاربری یا رمز عبور نادرست نشان داده شود

  قانون: نام کاربری به حروف بزرگ و کوچک حساس است

    مثال: تلاش برای ورود با نام کاربری در حروف متفاوت
      وقتی کاربری با نام کاربری "SINA.Q" و رمز عبور "Passw0rd!" وارد سیستم می شود
      انتظار می رود دسترسی به او داده نشود
      و پیغام خطای نام کاربری یا رمز عبور نادرست نشان داده شود

  قانون: کاربر حذف شده نمی تواند وارد سیستم شود

    مثال: تلاش برای ورود پس از حذف کاربر
      با در نظر گرفتن اینکه آن کاربر از سیستم حذف شده باشد
      وقتی آن کاربر با نام کاربری "sina.q" و رمز عبور "Passw0rd!" وارد سیستم می شود
      انتظار می رود دسترسی به او داده نشود
      و پیغام خطای نام کاربری یا رمز عبور نادرست نشان داده شود

  قانون: نشست کاربر پس از یک ساعت منقضی می شود

    مثال: تلاش برای دسترسی به سیستم پس از گذشت یک ساعت از ورود
      با در نظر گرفتن اینکه آن کاربر وارد سیستم شده باشد
      و یک ساعت گذشته باشد
      وقتی او تلاش می کند به سیستم دسترسی داشته باشد
      انتظار می رود دسترسی به او داده نشود
      و از او خواسته شود دوباره وارد سیستم شود

  قانون: کاربری که از سیستم خارج شده نمی تواند به سیستم دسترسی داشته باشد

    مثال: تلاش برای دسترسی به سیستم پس از خروج
      با در نظر گرفتن اینکه آن کاربر وارد سیستم شده باشد
      و از سیستم خارج شده باشد
      وقتی او تلاش می کند به سیستم دسترسی داشته باشد
      انتظار می رود دسترسی به او داده نشود
