# language: fa
قابلیت: ثبت کارمند

  پیش زمینه:
    با در نظر گرفتن اینکه یاشار وارد سیستم شده باشد

  سناریو: ثبت کارمند جدید
    وقتی یاشار کارمند جدیدی با اطلاعات معتبر ثبت می کند
    انتظار می رود کارمند جدید در سیستم ثبت شده باشد

  سناریو: ویرایش کارمند
    با در نظر گرفتن اینکه یک کارمند در سیستم ثبت شده باشد
    وقتی یاشار اطلاعات آن کارمند را ویرایش می کند
    انتظار می رود اطلاعات ویرایش شده کارمند در سیستم ثبت شده باشد

  سناریو: حذف کارمند
    با در نظر گرفتن اینکه یک کارمند در سیستم ثبت شده باشد
    وقتی یاشار آن کارمند را حذف می کند
    انتظار می رود آن کارمند از سیستم حذف شده باشد

  قانون: فقط مدیر سیستم مجاز به ثبت، ویرایش یا حذف کارمند است

    الگوی سناریو: تلاش کاربر بدون دسترسی برای ثبت کارمند جدید
      با در نظر گرفتن اینکه <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند کارمند جدیدی ثبت کند
      انتظار می رود کارمند جدیدی ثبت نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | مصطفی  |
        | نیکروش |
        | سینا   |

    الگوی سناریو: تلاش کاربر بدون دسترسی برای ویرایش کارمند
      با در نظر گرفتن اینکه یک کارمند در سیستم ثبت شده باشد
      و <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند اطلاعات آن کارمند را ویرایش کند
      انتظار می رود کارمند ویرایش نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | مصطفی  |
        | نیکروش |
        | سینا   |

    الگوی سناریو: تلاش کاربر بدون دسترسی برای حذف کارمند
      با در نظر گرفتن اینکه یک کارمند در سیستم ثبت شده باشد
      و <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند آن کارمند را حذف کند
      انتظار می رود آن کارمند از سیستم حذف نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | مصطفی  |
        | نیکروش |
        | سینا   |

  قانون: اسم کارمند نمی تواند خالی باشد

    مثال: ثبت کارمند بدون اسم
      وقتی یاشار اطلاعات کارمند جدید را وارد می کند
      اما اسم کارمند را خالی می گذارد
      انتظار می رود کارمند جدیدی ثبت نشده باشد
      و پیغام خطای اسم کارمند نشان داده شود

    مثال: پاک کردن اسم کارمند
      با در نظر گرفتن اینکه یک کارمند در سیستم ثبت شده باشد
      وقتی یاشار اسم آن کارمند را پاک می کند
      انتظار می رود کارمند ویرایش نشده باشد
      و پیغام خطای اسم کارمند نشان داده شود

  قانون: نام کاربری نمی تواند خالی باشد

    مثال: ثبت کارمند بدون نام کاربری
      وقتی یاشار اطلاعات کارمند جدید را وارد می کند
      اما نام کاربری را خالی می گذارد
      انتظار می رود کارمند جدیدی ثبت نشده باشد
      و پیغام خطای نام کاربری نشان داده شود

    مثال: پاک کردن نام کاربری
      با در نظر گرفتن اینکه یک کارمند در سیستم ثبت شده باشد
      وقتی یاشار نام کاربری آن کارمند را پاک می کند
      انتظار می رود کارمند ویرایش نشده باشد
      و پیغام خطای نام کاربری نشان داده شود

  قانون: نام کاربری هر کارمند باید یکتا باشد

    مثال: ثبت کارمند با نام کاربری تکراری
      با در نظر گرفتن اینکه کارمندی با نام کاربری "sina.q" در سیستم ثبت شده باشد
      وقتی یاشار کارمند جدیدی با نام کاربری "sina.q" ثبت می کند
      انتظار می رود کارمند جدیدی ثبت نشده باشد
      و پیغام خطای تکراری بودن نام کاربری نشان داده شود

    مثال: ویرایش نام کاربری به مقداری تکراری
      با در نظر گرفتن اینکه کارمندی با نام کاربری "sina.q" و کارمند دیگری با نام کاربری "ariana.m" در سیستم ثبت شده باشد
      وقتی یاشار نام کاربری "ariana.m" را به "sina.q" تغییر می دهد
      انتظار می رود کارمند ویرایش نشده باشد
      و پیغام خطای تکراری بودن نام کاربری نشان داده شود

  قانون: رمز عبور نمی تواند خالی باشد

    مثال: ثبت کارمند بدون رمز عبور
      وقتی یاشار اطلاعات کارمند جدید را وارد می کند
      اما رمز عبور را خالی می گذارد
      انتظار می رود کارمند جدیدی ثبت نشده باشد
      و پیغام خطای رمز عبور نشان داده شود

    مثال: پاک کردن رمز عبور
      با در نظر گرفتن اینکه یک کارمند در سیستم ثبت شده باشد
      وقتی یاشار رمز عبور آن کارمند را پاک می کند
      انتظار می رود کارمند ویرایش نشده باشد
      و پیغام خطای رمز عبور نشان داده شود

  قانون: نقش کارمند باید یکی از نقش های معتبر سیستم باشد

    مثال: ثبت کارمند با نقشی نامعتبر
      وقتی یاشار اطلاعات کارمند جدید را وارد می کند
      اما نقشی نامعتبر برای او انتخاب می کند
      انتظار می رود کارمند جدیدی ثبت نشده باشد
      و پیغام خطای نقش نامعتبر نشان داده شود
