# language: fa
قابلیت: ثبت کاربر

  پیش زمینه:
    با در نظر گرفتن اینکه یاشار وارد سیستم شده باشد

  سناریو: ثبت کاربر جدید
    وقتی یاشار کاربر جدیدی با اطلاعات معتبر ثبت می کند
    انتظار می رود کاربر جدید در سیستم ثبت شده باشد

  سناریو: ویرایش کاربر
    با در نظر گرفتن اینکه یک کاربر در سیستم ثبت شده باشد
    وقتی یاشار اطلاعات آن کاربر را ویرایش می کند
    انتظار می رود اطلاعات ویرایش شده کاربر در سیستم ثبت شده باشد

  سناریو: حذف کاربر
    با در نظر گرفتن اینکه یک کاربر در سیستم ثبت شده باشد
    وقتی یاشار آن کاربر را حذف می کند
    انتظار می رود آن کاربر از سیستم حذف شده باشد

  قانون: فقط مدیر سیستم مجاز به مشاهده لیست کاربران است

    الگوی سناریو: تلاش کاربر بدون دسترسی برای مشاهده لیست کاربران
      با در نظر گرفتن اینکه <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند لیست کاربران را مشاهده کند
      انتظار می رود لیست کاربران نمایش داده نشود
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | مصطفی  |
        | نیکروش |
        | سینا   |

  قانون: فقط مدیر سیستم مجاز به ثبت، ویرایش یا حذف کاربر است

    الگوی سناریو: تلاش کاربر بدون دسترسی برای ثبت کاربر جدید
      با در نظر گرفتن اینکه <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند کاربر جدیدی ثبت کند
      انتظار می رود کاربر جدیدی ثبت نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | مصطفی  |
        | نیکروش |
        | سینا   |

    الگوی سناریو: تلاش کاربر بدون دسترسی برای ویرایش کاربر
      با در نظر گرفتن اینکه یک کاربر در سیستم ثبت شده باشد
      و <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند اطلاعات آن کاربر را ویرایش کند
      انتظار می رود کاربر ویرایش نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | مصطفی  |
        | نیکروش |
        | سینا   |

    الگوی سناریو: تلاش کاربر بدون دسترسی برای حذف کاربر
      با در نظر گرفتن اینکه یک کاربر در سیستم ثبت شده باشد
      و <کاربر> وارد سیستم شده باشد
      وقتی <کاربر> تلاش می کند آن کاربر را حذف کند
      انتظار می رود آن کاربر از سیستم حذف نشده باشد
      و پیغام خطای عدم دسترسی نشان داده شود

      نمونه ها:
        | کاربر  |
        | مصطفی  |
        | نیکروش |
        | سینا   |

  قانون: اسم کاربر نمی تواند خالی باشد

    مثال: ثبت کاربر بدون اسم
      وقتی یاشار اطلاعات کاربر جدید را وارد می کند
      اما اسم کاربر را خالی می گذارد
      انتظار می رود کاربر جدیدی ثبت نشده باشد
      و پیغام خطای اسم کاربر نشان داده شود

    مثال: پاک کردن اسم کاربر
      با در نظر گرفتن اینکه یک کاربر در سیستم ثبت شده باشد
      وقتی یاشار اسم آن کاربر را پاک می کند
      انتظار می رود کاربر ویرایش نشده باشد
      و پیغام خطای اسم کاربر نشان داده شود

  قانون: نام کاربری نمی تواند خالی باشد

    مثال: ثبت کاربر بدون نام کاربری
      وقتی یاشار اطلاعات کاربر جدید را وارد می کند
      اما نام کاربری را خالی می گذارد
      انتظار می رود کاربر جدیدی ثبت نشده باشد
      و پیغام خطای نام کاربری نشان داده شود

    مثال: پاک کردن نام کاربری
      با در نظر گرفتن اینکه یک کاربر در سیستم ثبت شده باشد
      وقتی یاشار نام کاربری آن کاربر را پاک می کند
      انتظار می رود کاربر ویرایش نشده باشد
      و پیغام خطای نام کاربری نشان داده شود

  قانون: نام کاربری هر کاربر باید یکتا باشد

    مثال: ثبت کاربر با نام کاربری تکراری
      با در نظر گرفتن اینکه کاربری با نام کاربری "sina.q" در سیستم ثبت شده باشد
      وقتی یاشار کاربر جدیدی با نام کاربری "sina.q" ثبت می کند
      انتظار می رود کاربر جدیدی ثبت نشده باشد
      و پیغام خطای تکراری بودن نام کاربری نشان داده شود

    مثال: ویرایش نام کاربری به مقداری تکراری
      با در نظر گرفتن اینکه کاربری با نام کاربری "sina.q" و کاربر دیگری با نام کاربری "ariana.m" در سیستم ثبت شده باشد
      وقتی یاشار نام کاربری "ariana.m" را به "sina.q" تغییر می دهد
      انتظار می رود کاربر ویرایش نشده باشد
      و پیغام خطای تکراری بودن نام کاربری نشان داده شود

  قانون: رمز عبور نمی تواند خالی باشد

    مثال: ثبت کاربر بدون رمز عبور
      وقتی یاشار اطلاعات کاربر جدید را وارد می کند
      اما رمز عبور را خالی می گذارد
      انتظار می رود کاربر جدیدی ثبت نشده باشد
      و پیغام خطای رمز عبور نشان داده شود

    مثال: پاک کردن رمز عبور
      با در نظر گرفتن اینکه یک کاربر در سیستم ثبت شده باشد
      وقتی یاشار رمز عبور آن کاربر را پاک می کند
      انتظار می رود کاربر ویرایش نشده باشد
      و پیغام خطای رمز عبور نشان داده شود

  قانون: نقش کاربر باید یکی از نقش های معتبر سیستم باشد

    مثال: ثبت کاربر با نقشی نامعتبر
      وقتی یاشار اطلاعات کاربر جدید را وارد می کند
      اما نقشی نامعتبر برای او انتخاب می کند
      انتظار می رود کاربر جدیدی ثبت نشده باشد
      و پیغام خطای نقش نامعتبر نشان داده شود

    الگوی سناریو: ثبت کاربر با نقش معتبر
      وقتی یاشار کاربر جدیدی با نقش "<نقش>" ثبت می کند
      انتظار می رود کاربر جدید با نقش "<نقش>" در سیستم ثبت شده باشد

      نمونه ها:
        | نقش               |
        | مدیر سیستم        |
        | مدیریت            |
        | بازرس کنترل کیفیت |
        | گزارشگیر          |

  قانون: مدیر سیستم نمی تواند نقش خودش را تغییر دهد

    مثال: تلاش مدیر سیستم برای تغییر نقش خودش
      وقتی یاشار نقش خودش را تغییر می دهد
      انتظار می رود کاربر ویرایش نشده باشد
      و پیغام خطای عدم امکان تغییر نقش خود نشان داده شود
